In [2]:
import pandas as pd
import numpy as np

import json
import requests
import matplotlib.pyplot as plt
import seaborn as sns

from config import api_key

In [3]:
key = api_key

# Realestate Data

In [4]:
data = pd.read_csv('/Users/krishna/Documents/School/GeorgiaTech/HW/MyProjects/ProjectOne/Sale_Prices_Zip.csv')

In [5]:
data = data.rename(columns = {'RegionName': 'ZipCode'})

In [6]:
data = data[['ZipCode','StateName','2018-12']]
data.head(2)

   ZipCode StateName   2018-12
0    10025  New York  943200.0
1    60657  Illinois  429700.0

In [7]:
zc = data['ZipCode']

In [8]:
zipcode = []
for i in zc:
    i = str(i)
    
    if len(i) < 5:
        i = "0" + i
    elif len(i) > 5:
        i = i[:5]
    zipcode.append(i)

In [9]:
data['zipcode'] = zipcode
data = data.drop(columns = "ZipCode")
data = data.set_index('zipcode')

In [10]:
data.head()

        StateName   2018-12
zipcode
10025    New York  943200.0
60657    Illinois  429700.0
77494       Texas  323800.0
79936       Texas  127900.0
77449       Texas  190500.0

# Starbucks Data

In [11]:
starbucks_data = pd.read_csv('/Users/krishna/Documents/School/GeorgiaTech/HW/MyProjects/ProjectOne/starbucks.csv')

In [12]:
starbucks_data = starbucks_data[['Brand','Postcode','Country']]

In [13]:
starbucks_data = starbucks_data[starbucks_data.Country == 'US']

In [14]:
starbucks_data.head()

           Brand   Postcode Country
11964  Starbucks  995042300      US
11965  Starbucks  995073444      US
11966  Starbucks  995153596      US
11967  Starbucks      99515      US
11968  Starbucks  995152050      US

In [15]:
zc = starbucks_data["Postcode"]
zc.head()

11964    995042300
11965    995073444
11966    995153596
11967        99515
11968    995152050
Name: Postcode, dtype: object

In [16]:
starbucks_zc = []

In [17]:
for i in zc:
    i = str(i)
    
    if len(i) < 5:
        i = "0" + i
    elif len(i) > 5:
        i = i[:5]
        
    starbucks_zc.append(i)

In [18]:
starbucks_data = starbucks_data.drop(columns = ["Postcode","Country"])

In [19]:
starbucks_data['zipcode'] = starbucks_zc 
starbucks_data.head(2)

           Brand zipcode
11964  Starbucks   99504
11965  Starbucks   99507

In [20]:
starbucks_data = starbucks_data['zipcode'].value_counts().reset_index()
starbucks_data = starbucks_data.rename(columns = {'zipcode': 'starbucks_count', 'index':'zipcode'})
starbucks_data = starbucks_data.set_index('zipcode')

In [21]:
starbucks_data.head()

         starbucks_count
zipcode
89109                 32
98101                 24
90045                 21
10019                 20
92101                 20

# Target Data

In [22]:
target_data = pd.read_csv('/Users/krishna/Documents/School/GeorgiaTech/HW/MyProjects/ProjectOne/target.csv')
target_data.head(2)

  Address.PostalCode Address.Subdivision
0         36203-3459                  AL
1         36801-1511                  AL

In [23]:
target_data = target_data['Address.PostalCode']

In [24]:
target_zipcode = []
for i in target_data:
    i = i[:5]
    target_zipcode.append(i)

In [25]:
target_data = pd.DataFrame(columns = ['zipcode'])
target_data['zipcode'] = target_zipcode

In [26]:
target_data = pd.DataFrame(target_data['zipcode'].value_counts()).reset_index()

In [27]:
target_data = target_data.rename(columns = {"zipcode" : "target_count", "index":"zipcode" })
target_data = target_data.set_index('zipcode')
target_data.head()

         target_count
zipcode
15237               3
55125               2
11725               2
94538               2
28277               2

# Fast Food Resturant

In [28]:
fast_food_data = pd.read_csv('/Users/krishna/Documents/School/GeorgiaTech/HW/MyProjects/ProjectOne/FastFoodRestaurants.csv')

In [29]:
fast_food_data = fast_food_data[['postalCode','name']]

In [30]:
fast_food_data = fast_food_data.sort_values(by = ['name'])

In [31]:
fast_food_data.head()

     postalCode                     name
4630      11103         31st Avenue Gyro
8733      96766                     7-11
8834       4101                 7-Eleven
5526      54880  A & W Family Restaurant
9134      51401                      A&W

In [32]:
junkfood_list = fast_food_data['postalCode']

In [33]:
food_list = []
for i in junkfood_list:
    i = str(i)
    
    if len(i) < 5:
        i = "0" + i
    elif len(i) > 5:
        i = i[:5]
    
    food_list.append(i)

In [34]:
fast_food_data['zipcode'] = food_list
fast_food_data = fast_food_data.drop(columns = ['postalCode'])
fast_food_data = pd.DataFrame(fast_food_data['zipcode'].value_counts())
fast_food_data = fast_food_data.reset_index()
fast_food_data = fast_food_data.rename(columns = {'zipcode' : "fastfoodstores", "index":"zipcode"})
fast_food_data = fast_food_data.set_index('zipcode')

In [35]:
fast_food_data.head()

         fastfoodstores
zipcode
57701                23
41042                19
45069                16
23185                15
99336                15

In [36]:
fast_food_data.head()

         fastfoodstores
zipcode
57701                23
41042                19
45069                16
23185                15
99336                15

# Final Data Merge

In [37]:
data.head(2)

        StateName   2018-12
zipcode
10025    New York  943200.0
60657    Illinois  429700.0

In [38]:
starbucks_data.head(2)

         starbucks_count
zipcode
89109                 32
98101                 24

In [39]:
target_data.head(2)

         target_count
zipcode
15237               3
55125               2

In [40]:
fast_food_data.head(2)

         fastfoodstores
zipcode
57701                23
41042                19

In [41]:
merged_data = data.merge(starbucks_data, 'left', on = 'zipcode')

In [42]:
merged_data = merged_data.merge(target_data, 'left', on='zipcode')

In [43]:
merged_data = merged_data.merge(fast_food_data, 'left', on = 'zipcode')

In [44]:
merged_data = merged_data.sort_values(by = ['target_count', 'starbucks_count'], ascending= False)
merged_data = merged_data.reset_index()

In [45]:
merged_data.head(20)

,zipcode,StateName,2018-12,starbucks_count,target_count,fastfoodstores
0,15237,Pennsylvania,230100.0,6.0,3.0,1.0
1,28277,North Carolina,325600.0,10.0,2.0,NaN
2,94538,California,919700.0,10.0,2.0,2.0
3,93003,California,555200.0,10.0,2.0,1.0
4,60657,Illinois,429700.0,9.0,2.0,NaN
5,95123,California,883200.0,9.0,2.0,1.0
6,92691,California,651400.0,9.0,2.0,1.0
7,90650,California,480100.0,8.0,2.0,1.0
8,92683,California,652400.0,8.0,2.0,3.0
9,95014,California,NaN,8.0,2.0,1.0
10,46032,Indiana,319500.0,8.0,2.0,1.0
11,66062,Kansas,263700.0,7.0,2.0,NaN
12,93065,California,580600.0,7.0,2.0,NaN
13,91710,California,475500.0,7.0,2.0,4.0
14,80525,Colorado,392800.0,7.0,2.0,3.0
15,94568,California,884100.0,7.0,2.0,NaN
16,74133,Oklahoma,181600.0,7.0,2.0,4.0
17,80016,Colorado,528900.0,7.0,2.0,2.0
18,80012,Colorado,291500.0,7.0,2.0,2.0
19,92111,California,538600.0,7.0,2.0,1.0

In [46]:
#final_data = merged_data.to_csv('ProjectOne')

In [47]:
#final_data